micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_adc.h
/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */
#define HAL_ADC_ERROR_NONE              (0x00U)   /*!< No error                                    */
#define HAL_ADC_ERROR_INTERNAL          (0x01U)   /*!< ADC peripheral internal error (problem of clocking,
                                                       enable/disable, erroneous state, ...)       */
#define HAL_ADC_ERROR_OVR               (0x02U)   /*!< Overrun error                               */
#define HAL_ADC_ERROR_DMA               (0x04U)   /*!< DMA transfer error                          */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U)   /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define ADC_RESOLUTION_12B                 (LL_ADC_RESOLUTION_12B)  /*!< ADC resolution 12 bits */
#define ADC_RESOLUTION_10B                 (LL_ADC_RESOLUTION_10B)  /*!< ADC resolution 10 bits */
#define ADC_RESOLUTION_8B                  (LL_ADC_RESOLUTION_8B)   /*!< ADC resolution  8 bits */
#define ADC_RESOLUTION_6B                  (LL_ADC_RESOLUTION_6B)   /*!< ADC resolution  6 bits */
/**
  * @}
  */

/** @defgroup ADC_Scan_mode ADC sequencer scan mode
  * @{
  */
#define ADC_SCAN_DISABLE         (0x00000000UL)       /*!< Scan mode disabled */
#define ADC_SCAN_ENABLE          (0x00000001UL)       /*!< Scan mode enabled  */

/** @defgroup ADC_Private_Constants ADC Private Constants
  * @{
  */

/* Combination of all post-conversion flags bits: EOC/EOS, OVR, AWD */
#define ADC_FLAG_POSTCONV_ALL    (ADC_FLAG_AWD | ADC_FLAG_OVR | ADC_FLAG_EOS | ADC_FLAG_EOC)
/**
  * @}
  */

/* Combination of all CHSELR bits: SQ2...SQ8 */
#define ADC_CHSELR_SQ2_TO_SQ8           (ADC_CHSELR_SQ2 | ADC_CHSELR_SQ3 | ADC_CHSELR_SQ4 | ADC_CHSELR_SQ5\
                                         | ADC_CHSELR_SQ6 | ADC_CHSELR_SQ7 | ADC_CHSELR_SQ8)
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_source ADC group regular trigger source
  * @{
  */
#define ADC_SOFTWARE_START                 (LL_ADC_REG_TRIG_SOFTWARE)                /*!< ADC group regular conversion
                                            trigger internal: SW start. */
#define ADC_EXTERNALTRIG_EXT_IT11          (LL_ADC_REG_TRIG_EXT_EXTI_LINE11)         /*!< ADC group regular conversion
                                           trigger from external peripheral: external interrupt line 11. */
#define ADC_EXTERNALTRIG_T1_CC1            (LL_ADC_REG_TRIG_EXT_TIM1_CH1)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM1 channel 1 event (capture compare). */
#define ADC_EXTERNALTRIG_T1_CC2            (LL_ADC_REG_TRIG_EXT_TIM1_CH2)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM1 channel 2 event (capture compare). */
#define ADC_EXTERNALTRIG_T1_CC3            (LL_ADC_REG_TRIG_EXT_TIM1_CH3)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM1 channel 3 event (capture compare). */
#define ADC_EXTERNALTRIG_T1_TRGO           (LL_ADC_REG_TRIG_EXT_TIM1_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM1 TRGO event. */
#define ADC_EXTERNALTRIG_T1_TRGO2          (LL_ADC_REG_TRIG_EXT_TIM1_TRGO2)          /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM1 TRGO2 event. */
#define ADC_EXTERNALTRIG_T2_CC2            (LL_ADC_REG_TRIG_EXT_TIM2_CH2)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM2 channel 2 event (capture compare). */
#define ADC_EXTERNALTRIG_T2_TRGO           (LL_ADC_REG_TRIG_EXT_TIM2_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM2 TRGO event. */
#define ADC_EXTERNALTRIG_T3_CC4            (LL_ADC_REG_TRIG_EXT_TIM3_CH4)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM3 channel 4 event (capture compare). */
#define ADC_EXTERNALTRIG_T3_TRGO           (LL_ADC_REG_TRIG_EXT_TIM3_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM3 TRGO event. */
#define ADC_EXTERNALTRIG_T4_CC4            (LL_ADC_REG_TRIG_EXT_TIM4_CH4)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM4 channel 4 event (capture compare). */
#define ADC_EXTERNALTRIG_T4_TRGO           (LL_ADC_REG_TRIG_EXT_TIM4_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM4 TRGO event. */
#define ADC_EXTERNALTRIG_T5_TRGO           (LL_ADC_REG_TRIG_EXT_TIM5_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM5 TRGO event. */
#define ADC_EXTERNALTRIG_T6_TRGO           (LL_ADC_REG_TRIG_EXT_TIM6_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM6 TRGO event. */
#define ADC_EXTERNALTRIG_T7_TRGO           (LL_ADC_REG_TRIG_EXT_TIM7_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM7 TRGO event. */
#define ADC_EXTERNALTRIG_T8_TRGO           (LL_ADC_REG_TRIG_EXT_TIM8_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM8 TRGO event. */
#define ADC_EXTERNALTRIG_T8_TRGO2          (LL_ADC_REG_TRIG_EXT_TIM8_TRGO2)          /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM8 TRGO2 event. */
#define ADC_EXTERNALTRIG_T9_CC1            (LL_ADC_REG_TRIG_EXT_TIM9_CH1)            /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM9 channel 1 event (capture compare). */
#define ADC_EXTERNALTRIG_T9_TRGO           (LL_ADC_REG_TRIG_EXT_TIM9_TRGO)           /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM9 TRGO event. */
#define ADC_EXTERNALTRIG_T12_TRGO          (LL_ADC_REG_TRIG_EXT_TIM12_TRGO)          /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM12 TRGO event. */
#define ADC_EXTERNALTRIG_T15_TRGO          (LL_ADC_REG_TRIG_EXT_TIM15_TRGO)          /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM15 TRGO event. */
#define ADC_EXTERNALTRIG_T18_TRGO          (LL_ADC_REG_TRIG_EXT_TIM18_TRGO)          /*!< ADC group regular conversion
                                           trigger from external peripheral: TIM18 TRGO event. */
#define ADC_EXTERNALTRIG_LPTIM1_CH1        (LL_ADC_REG_TRIG_EXT_LPTIM1_CH1)          /*!< ADC group regular conversion
                                           trigger from external peripheral: LPTIM1 channel 1 event. */
#define ADC_EXTERNALTRIG_LPTIM2_CH1        (LL_ADC_REG_TRIG_EXT_LPTIM2_CH1)          /*!< ADC group regular conversion
                                           trigger from external peripheral: LPTIM2 channel 2 event. */
#define ADC_EXTERNALTRIG_LPTIM3_CH1        (LL_ADC_REG_TRIG_EXT_LPTIM3_CH1)          /*!< ADC group regular conversion
                                           trigger from external peripheral: LPTIM3 channel 3 event. */
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_edge ADC group regular trigger edge (when external trigger is selected)
  * @{
  */
#define ADC_EXTERNALTRIGCONVEDGE_NONE           (0x00000000UL)                      /*!< ADC group regular trigger
                                                disabled (SW start)*/
#define ADC_EXTERNALTRIGCONVEDGE_RISING         (LL_ADC_REG_TRIG_EXT_RISING)        /*!< ADC group regular conversion
                                                trigger polarity set to rising edge */
#define ADC_EXTERNALTRIGCONVEDGE_FALLING        (LL_ADC_REG_TRIG_EXT_FALLING)       /*!< ADC group regular conversion
                                                trigger polarity set to falling edge */
#define ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING  (LL_ADC_REG_TRIG_EXT_RISINGFALLING) /*!< ADC group regular conversion
                                                trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_regular_sampling_mode ADC group regular sampling mode
  * @{
  */
#define ADC_SAMPLING_MODE_NORMAL                (0x00000000UL)      /*!< ADC conversions sampling phase duration is
                                                defined using  @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME */
#define ADC_SAMPLING_MODE_BULB                  (ADC_CFGR2_BULB)    /*!< ADC conversions sampling phase starts
                                                immediately after end of conversion, and stops upon trigger event.
                                                Note: First conversion is using minimal sampling time
                                                      (see @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME) */
#define ADC_SAMPLING_MODE_TRIGGER_CONTROLED     (ADC_CFGR2_SMPTRIG) /*!< ADC conversions sampling phase is controlled
                                                by trigger events:
                                                Trigger rising edge  = start sampling
                                                Trigger falling edge = stop sampling and start conversion */
/**
  * @}
  */

/** @defgroup ADC_EOCSelection ADC sequencer end of unitary conversion or sequence conversions
  * @{
  */
#define ADC_EOC_SINGLE_CONV         (ADC_ISR_EOC)                 /*!< End of unitary conversion flag  */
#define ADC_EOC_SEQ_CONV            (ADC_ISR_EOS)                 /*!< End of sequence conversions flag    */
/**
  * @}
  */

